Revit.Elements.LinePatternElement
Line Pattern Element

Revit.Elements.LinePatternElement.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.LinePatternElement.InternalElement
Reference to the Element

Revit.Elements.LinePatternElement.InternalSetElement(Autodesk.Revit.DB.LinePatternElement)
Set the internal Element, ElementId, and UniqueId
e:

Revit.Elements.LinePatternElement.#ctor(Autodesk.Revit.DB.LinePatternElement)
LinePatternElement from existing
e:

Revit.Elements.LinePatternElement.InitElement(Autodesk.Revit.DB.LinePatternElement)
Init LinePatternElement from existing
e:

Revit.Elements.LinePatternElement.GetByName(System.String)
Line Pattern Element by name.
name: Name of the line pattern.
Filled Pattern Element.

Revit.Elements.LinePatternElement.FromExisting(Autodesk.Revit.DB.LinePatternElement,System.Boolean)
From existing element
instance:
isRevitOwned:
Returns: